acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
/*
 * Copyright (c) 2014, Texas Instruments Incorporated - http://www.ti.com/
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*---------------------------------------------------------------------------*/
/**
 * \addtogroup cc13xx-platforms
 * @{
 *
 * \defgroup cc13xx-examples CC13xx Example Projects
 *
 * Example projects for CC13xx-based platforms.
 * @{
 *
 * \defgroup cc13xx-demo CC13xx Demo Project
 *
 *   Example project demonstrating the CC13xx platforms
 *
 *   This example will work for the following boards:
 *   - The CC1310 Apros AP
 *
 *   By default, the example will build for the srf06-cc13xx board. To switch
 *   between platforms:
 *   - make clean
 *   - make BOARD=srf06/cc13xx savetarget
 *
 *     or
 *
 *     make BOARD=srf06-cc26xx savetarget
 *
 *   This example also demonstrates CC13xx BLE operation. The process starts
 *   the BLE beacon daemon (implemented in the RF driver). The daemon will
 *   send out a BLE beacon periodically. Use any BLE-enabled application (e.g.
 *   LightBlue on OS X or the TI BLE Multitool smartphone app) and after a few
 *   seconds the cc13xx device will be discovered.
 *
 * - etimer/clock : Every CC26XX_DEMO_LOOP_INTERVAL clock ticks the LED defined
 *                  as CC26XX_DEMO_LEDS_PERIODIC will toggle and the device
 *                  will print out readings from some supported sensors
 * - sensors      : Some sensortag sensors are read asynchronously (see sensor
 *                  documentation). For those, this example will print out
 *                  readings in a staggered fashion at a random interval
 *
 * @{
 *
 * \file
 *     Example demonstrating the cc13xx platforms
 */
#include "contiki.h"
#include "sys/etimer.h"
#include "sys/ctimer.h"
#include "sys/stimer.h"
#include "sys/rtimer.h"
#include "dev/leds.h"
#include "lib/sensors.h"
#include "dev/watchdog.h"
#include "random.h"
#include "board-peripherals.h"
#include "net/rime/rime.h"

#include "ieee-addr.h"
#include "dev/uart1.h"
#include "apros-wireless-line.h"
#include "apros-command-scheduler.h"
#include "apros-serial-line.h"
#include "apros-gpio-control.h"
#include "apros-packet-control.h"
#include "apros-flash-control.h"
#include "net/netstack.h"

#include "../ads127l01-sensor.h"
#include "m41t64.h"
#if APROS_BATTERY_READ
#include "battery_adc_read.h"
#endif
#if APROS_STS3X
#include "sts3x.h"
#endif

#include "ti-lib.h"

#include "cc13xx-node.h"

#include <stdio.h>

#define DEBUG DEBUG_NONE
#include "net/ip/uip-debug.h"

/*****************************************************************************
Global Variable & Definition
******************************************************************************/

/*---------------------------------------------------------------------------*/
/** DEV Identity **/
#define NAME 0xADC2405

#define DEFAULT_VENDOR_NAME "APROS Co."
/** Channel **/
#define DEFAULT_NODE_CH 5

#define DEFAULT_CCA_THRESHOLD -100

#define MAX_CCA_THRESHOLD -60
#define MIN_CCA_THRESHOLD -120

/** Sampling **/
#define MIN_SAMPLING_EXP 6  //64
#define MIN_SAMPLING_NUM (2<<(MIN_SAMPLING_EXP-1))

#define MAX_SAMPLING_EXP 12 // 4096
#define MAX_SAMPLING_NUM (2<<(MAX_SAMPLING_EXP-1))

#define DEFAULT_SAMPLING_EXP 12

/** Offset **/
#ifdef SENSOR_BOARD_CONF_OFFSET 
#define DEFAULT_OFFSET SENSOR_BOARD_CONF_OFFSET
#else
#define DEFAULT_OFFSET 0
#endif 
/** Bit Unit **/
#define BYTE_UNIT 3 // 24bit

/** Axis **/
#define MAX_AXIS 1 
#define MIN_AXIS 1
/** Offset **/
#define MAX_OFFSET_BOUND_SIGNED ((1<<((BYTE_UNIT<<3)-1))-1)
#define MIN_OFFSET_BOUND_SIGNED (-(1<<((BYTE_UNIT<<3)-1)))

#define MAX_VALUE_BOUND_SIGNED ((1<<((BYTE_UNIT<<3)-1))-1)
#define MIN_VALUE_BOUND_SIGNED (-(1<<((BYTE_UNIT<<3)-1)))

#define MAX_VALUE_BOUND_UNSIGNED ((1<<(BYTE_UNIT<<3))-1)
#define MIN_VALUE_BOUND_UNSIGNED 0

/** Buffer for ADC Read **/ 
static uint8_t z_axis_val[MAX_SAMPLING_NUM*BYTE_UNIT];
//static uint16_t z_axis_val_index;
#define MAX_ACCEL_DATA_LEN 48

/** Channel **/
#define AVAILABLE_CHANNEL 0x00FD2490
// 5, 8, 11, 14, 17, 19, 20, 21, 22, 23, 24

/** flash **/
static apros_node_config_t node_config;

/** Primary Timer **/
static struct etimer et;
static struct rtimer rt;
static struct ctimer ct; 
/** Dedicated Timer **/


/** MAC Address **/
static uint8_t node_mac[8] = {0, 0, 0, 0, 0, 0, 0, 0};

/** Others. **/
static node_info_t my_node_info;
static msg_info_t my_msg_info;

static uint8_t last_axis_value;
static uint8_t last_accel_data_len;
static uint16_t last_max_index;

uint32_t bat_val_capt;
uint8_t temperature_capt[2];

static clock_time_t br_ack_backoff_time;

static uint8_t flag_registered;

