acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
static uint8_t flag_processing_msg;
static uint8_t flag_processing_fetch;
static uint8_t flag_processing_capt;
static uint8_t flag_processing_reboot;
static uint8_t flag_processing_flash;

static uint8_t flag_exist_capt;

static uint8_t error_pass_seq;
#if !APROS_OLD_DF
static uint8_t flag_sent_ready_rsp;
#endif
/*****************************************************************************
Funtion Declaration
******************************************************************************/


/*****************************************************************************
Function Definition
******************************************************************************/
/*---------------------------------------------------------------------------*/
/* Init  */
/*---------------------------------------------------------------------------*/
static void packet_recv(uint8_t* pbuf, uint16_t plen);

static inline clock_time_t calc_backoff(uint8_t mac_addr[]){
	uint16_t base_value = ((uint16_t)mac_addr[6] << 8) + mac_addr[7];

	return (clock_time_t)base_value%128;
}
/*---------------------------------------------------------------------------*/
void apply_channel(uint8_t channel){
	NETSTACK_RADIO.set_value(RADIO_PARAM_CHANNEL, channel);
	PRINTF(" apply ch : %d\n", channel);
}
/*---------------------------------------------------------------------------*/
void apply_cca(uint8_t cca_value){
	if((int8_t)cca_value < MIN_CCA_THRESHOLD || (int8_t)cca_value > MAX_CCA_THRESHOLD){
		NETSTACK_RADIO.set_value(RADIO_PARAM_CCA_THRESHOLD, DEFAULT_CCA_THRESHOLD);
		PRINTF(" cca threshold = %d\n", DEFAULT_CCA_THRESHOLD);
	}else{
		NETSTACK_RADIO.set_value(RADIO_PARAM_CCA_THRESHOLD, cca_value);
		PRINTF(" cca threshold = %d\n", cca_value);
	}
}	
/*---------------------------------------------------------------------------*/
static void cc1310_config_init(void){
	node_config.dev_name = NAME;
	memset(node_config.base_id, 0, 8);
	node_config.channel = DEFAULT_NODE_CH;
	node_config.sampling_exp = DEFAULT_SAMPLING_EXP;
	node_config.cca_th = DEFAULT_CCA_THRESHOLD;
	
	node_config.ofc[0] = DEFAULT_OFFSET & 0xff;
	node_config.ofc[1] = (DEFAULT_OFFSET>>8) & 0xff;
	node_config.ofc[2] = (DEFAULT_OFFSET>>16) & 0xff;
	memset(node_config.__vendor, 0, VENDOR_MAX_LEN);
	memcpy(node_config.__vendor, DEFAULT_VENDOR_NAME, sizeof(DEFAULT_VENDOR_NAME));
}
/*---------------------------------------------------------------------------*/
static void init_setting(void)
{
	ieee_addr_cpy_to(node_mac, 8);

	apros_node_config_load(&node_config);
	if(node_config.dev_name != NAME){
		cc1310_config_init();
		apros_node_config_save(&node_config);
	}
	
	memcpy(my_node_info.node_id, node_mac, 8);
	my_node_info.msg_num = 0;//not used value;
	my_node_info.msg_info = &my_msg_info;
	my_msg_info.p_node_info = &my_node_info;
	my_msg_info.p_cont_block_info = NULL;//Null value

	if(linkaddr_cmp((linkaddr_t*)(node_config.base_id+6), &linkaddr_null)){
		flag_registered = 0;
	}else{
		flag_registered = 1;
	}

	add_all_block_info();
	  
	br_ack_backoff_time = calc_backoff(node_mac);
	apply_channel(node_config.channel);
	apply_cca(node_config.cca_th);
  	apros_serial_line_init();
  	apros_wireless_line_init(packet_recv, NULL);

  	/*m41t64_init();
  	m41t64_reg_write(M41T64_REG_0A, 0x60);
  	m41t64_reg_write(M41T64_REG_04, 0x50);
  	m41t64_close();*/
  
	//printf("ofc : %02x%02x%02x\n", node_config.ofc[0], node_config.ofc[1], node_config.ofc[2]);

	
}
/*---------------------------------------------------------------------------*/
/* Communication  */
/*---------------------------------------------------------------------------*/
//This Function is only for SHORT Address
static uint8_t
generate_pkt_wireless(linkaddr_t* dest_short_addr, uint8_t m_type, struct tlv_set* tlv_buf, uint8_t tlv_num){
	static uint8_t pkt[APROS_PKT_MAX_SIZE];
 	uint8_t tlv_index;
	uint8_t ret = 0;

	if(apros_init_pkt(pkt, APROS_PKT_MAX_SIZE, m_type)){
		for(tlv_index = 0 ; tlv_index < tlv_num ; tlv_index++){
			if(apros_insert_tlv(pkt, tlv_buf+tlv_index)){

			}else{
				return ret;
			}
		}
		if(apros_complete_pkt(pkt)){
			if(frame802154_is_broadcast_addr(FRAME802154_SHORTADDRMODE, (uint8_t*)dest_short_addr)){
				PRINTF("SEND BROADCAST\n");
				apros_send_broadcast(pkt, get_pkt_length(pkt));
				ret = 1;
			}else{
				PRINTF("SEND UNICAST to %x.%x\n", dest_short_addr->u8[0], dest_short_addr->u8[1]);
				apros_send_unicast(dest_short_addr, pkt, get_pkt_length(pkt));
				ret = 1;
			}
		}
	}
	return ret;
}
/*---------------------------------------------------------------------------*/
/*static uint8_t
generate_pkt_serial(uint8_t m_type, struct tlv_set* tlv_buf, uint16_t tlv_num){
	static uint8_t pkt[APROS_PKT_MAX_SIZE];
 	uint8_t tlv_index;
	uint8_t ret = 0;

	if(apros_init_pkt(pkt, APROS_PKT_MAX_SIZE, m_type)){
		
		for(tlv_index = 0 ; tlv_index < tlv_num ; tlv_index++){
			if(apros_insert_tlv(pkt, tlv_buf+tlv_index)){
					
			}else{
				return ret;
			}
		}
		if(apros_complete_pkt(pkt)){
			apros_serial_send(pkt, get_pkt_length(pkt));
		}
	}
	return ret;
}*/
/*---------------------------------------------------------------------------*/
static uint8_t verify_addr(uint8_t* pl){
	struct tlv_set id_tlv;
	
	id_tlv.type = pl[0];
	id_tlv.length = pl[1];
	id_tlv.value = pl+2;
	
	if(id_tlv.type == BLK_TYPE_ID && id_tlv.length == 8){
		if(!memcmp(node_mac, id_tlv.value, 8)){ 
			return MY_ADDR;
		}else if(frame802154_is_broadcast_addr(FRAME802154_LONGADDRMODE, id_tlv.value)){
			return BR_ADDR;
		}else{
			return OTHER_ADDR;
		}
	}
	return 0;
}
/*---------------------------------------------------------------------------*/

/* Sub-Function for Command */
/*---------------------------------------------------------------------------*/
static void dev_reset(void* ptr){
	watchdog_reboot();
}
/*---------------------------------------------------------------------------*/
static uint8_t verity_ch(uint8_t ch){
	uint32_t val = 1;
	return (((val << (ch-1)) & AVAILABLE_CHANNEL) != 0);
}
/*---------------------------------------------------------------------------*/
static void subfunc_response_wireless(void* ptr){
	tlv_buf_hdr_t* tlv_buf_hdr = (tlv_buf_hdr_t*)ptr;

	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
		tlv_buf_hdr->tlv_p, tlv_buf_hdr->tlv_num);
}
/*---------------------------------------------------------------------------*/
static void subfunc_error_rsp_wireless(void* ptr){
	error_cb_st_t* er = (error_cb_st_t*)ptr;
	tlv_buf_hdr_t tlv_hdr;
	tlv_set_t tlv_set[2];
	static uint8_t rsp[20];

	uint16_t i = 0;
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = er->msg_info->p_node_info->node_id;
	
	tlv_set[i].type = er->msg_info->p_cont_block_info->type;
	tlv_set[i].length = er->msg_info->p_cont_block_info->rsp_length;
/*
#if APROS_OLD_DF
	if(tlv_set[i].type == BLK_TYPE_DATA_FETCH|| tlv_set[i].type == BLK_TYPE_RETT)
#else
	if(tlv_set[i].type == BLK_TYPE_DATA_FETCH_READY|| tlv_set[i].type == BLK_TYPE_RETT)
#endif
	{
		static uint8_t rsp[6];
		tlv_set[i].length = 6;
		rsp[0] = er->error_type;
		rsp[1] = 0xff;
		rsp[2] = 0xff;
		rsp[3] = 0xff;
		rsp[4] = 0xff;
		rsp[5] = 0xff;
		tlv_set[i++].value = rsp;
	}
#if !APROS_OLD_DF
    else if(tlv_set[i].type == BLK_TYPE_GET_NODEINFO){
		static uint8_t rsp[BLK_RSP_LEN_GET_NODEINFO];
		tlv_set[i].length = BLK_RSP_LEN_GET_NODEINFO;
		
		rsp[0] = er->error_type;
		for(uint8_t j=1; j < BLK_RSP_LEN_GET_NODEINFO; i++){
			rsp[j] = 0xff;
		}
		
		tlv_set[i++].value = rsp;
	}
#endif

