acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
	else{
		tlv_set[i].length = 1;
		tlv_set[i++].value = &er->error_type;
	}
*/
	
	rsp[0] = er->error_type;
	for(uint8_t j=1 ;j < tlv_set[i].length ; j++){
		rsp[j] = 0xff;
	}
	if(er->msg_info->p_cont_block_info->type == BLK_TYPE_DATA_FETCH_READY){
		rsp[1] = error_pass_seq;
	}
	if(er->msg_info->p_cont_block_info->type == BLK_TYPE_DATA_FETCH_START){
		rsp[1] = error_pass_seq;
	}
	tlv_set[i++].value = rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;

	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL,
		tlv_hdr.tlv_p, tlv_hdr.tlv_num);
}
/*---------------------------------------------------------------------------*/
static void subfunc_apply_ch(void* ptr){
	apply_channel(node_config.channel);
}
/*---------------------------------------------------------------------------*/
static void subfunc_dev_reset(void* ptr){
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	
	PRINTF("CALL dev_reset\n");
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_DEV_RESET;
	tlv_set[i].length = BLK_RSP_LEN_DEV_RESET;
	rsp = RESPONSE_SUCCESS;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;

	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
		tlv_hdr.tlv_p, tlv_hdr.tlv_num);
	
	ctimer_set(&ct, CLOCK_SECOND, dev_reset, NULL);
}
/*---------------------------------------------------------------------------*/
static void subfunc_factory_reset(void* ptr){
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	
	PRINTF("CALL factory_reset\n");

	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_FTRY_RESET;
	tlv_set[i].length = BLK_RSP_LEN_FTRY_RESET;
	rsp = RESPONSE_SUCCESS;
	
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
		tlv_hdr.tlv_p, tlv_hdr.tlv_num);

	cc1310_config_init();
	
	apros_node_config_save(&node_config);
	
	ctimer_set(&ct, CLOCK_SECOND, dev_reset, NULL);	
}
/*---------------------------------------------------------------------------*/
static void subfunc_register_node(void* ptr){	
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	uint8_t base_id_backup[8];
	
	PRINTF("START register\n");
	
	memcpy(base_id_backup, node_config.base_id, 8);
	memcpy(node_config.base_id, (uint8_t*)ptr, 8);
	
	if(apros_node_config_save(&node_config)){
		rsp = RESPONSE_SUCCESS;

		PRINTF("BASE ID = ");
		for(int j = 0 ; j < 8 ; j ++){
			PRINTF("%02X ", node_config.base_id[j]);
		}
		PRINTF("\n");
		
		flag_registered = 1;
	}else{
		rsp = RESPONSE_FLASH_ERROR;
		memcpy(node_config.base_id, base_id_backup, 8);
		apros_node_config_save(&node_config);
	}
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_REGISTER_NODE;
	tlv_set[i].length = BLK_RSP_LEN_REGISTER_NODE;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	
	apros_command(comm);
	flag_processing_flash = 0;
	PRINTF("END register\n");
	
}
/*---------------------------------------------------------------------------*/
static void subfunc_set_cca(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	uint8_t node_cca;
	
	PRINTF("START set_cca\n");	
	
	node_cca = node_config.cca_th;
	node_config.cca_th = *((uint8_t*)ptr);
	
	if((int8_t)node_config.cca_th < MIN_CCA_THRESHOLD || (int8_t)node_config.cca_th > MAX_CCA_THRESHOLD){
		rsp = RESPONSE_INVALID_ARGU;
		node_config.cca_th = node_cca;
	}else{
	    if(apros_node_config_save(&node_config)){
			rsp = RESPONSE_SUCCESS;
			apply_cca(node_config.cca_th);
		}else{
			rsp = RESPONSE_FLASH_ERROR;
			node_config.cca_th = node_cca;
			apros_node_config_save(&node_config);
		}
	}
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_SET_NODECCA;
	tlv_set[i].length = BLK_RSP_LEN_SET_NODECCA;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	
	flag_processing_flash=0;
	
	PRINTF("END set_cca\n");
	
}
/*---------------------------------------------------------------------------*/
static void subfunc_get_cca(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t cca_val;

	uint16_t i = 0;
	
	PRINTF("START get_cca\n");

	cca_val = node_config.cca_th;
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_NODECCA;
	tlv_set[i].length = BLK_RSP_LEN_GET_NODECCA;
	tlv_set[i++].value = &cca_val;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	PRINTF("END get_cca\n");
	
}
/*---------------------------------------------------------------------------*/
static void subfunc_set_nodech(void* ptr){
	apros_comm_param_t comm[2];
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	uint8_t node_ch_backup;
	
	PRINTF("START set_node_ch\n");	
	
	node_ch_backup = node_config.channel;
	node_config.channel = *((uint8_t*)ptr);
	
	/*if(apros_node_config_save(&node_config) && 
		verity_ch(node_config.channel)){
		rsp = RESPONSE_SUCCESS;
		PRINTF("NODE_CH = %d\n", node_config.channel);
	}else{
		rsp = RESPONSE_FLASH_ERROR;
		node_config.channel = node_ch_backup;
		apros_node_config_save(&node_config);
		PRINTF("FAIL\n");
	}*/

