acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
	if(verity_ch(node_config.channel)){
		if(apros_node_config_save(&node_config)){
			rsp = RESPONSE_SUCCESS;
			PRINTF("NODE_CH = %d\n", node_config.channel);
		}else{
			rsp = RESPONSE_FLASH_ERROR;
			node_config.channel = node_ch_backup;
			apros_node_config_save(&node_config);
			PRINTF("FAIL\n");
		}
	}else{
		rsp = RESPONSE_NOT_SURPT_CH;
		node_config.channel = node_ch_backup;
		PRINTF("FAIL\n")
	}
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_SET_NODECH;
	tlv_set[i].length = BLK_RSP_LEN_SET_NODECH;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm[0].func = subfunc_response_wireless;
	comm[0].func_param = &tlv_hdr;
	comm[0].t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm[0]);
	
	if(rsp == RESPONSE_SUCCESS){
		comm[1].func = subfunc_apply_ch;
		comm[1].func_param = NULL;
		comm[1].t_backoff = APROS_COMM_PRIOR_7;
		
		apros_command(comm[1]);
	}
	flag_processing_flash=0;
	
	PRINTF("END set_node_ch\n");
	
}
/*---------------------------------------------------------------------------*/
static void subfunc_get_nodech(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t node_ch;

	uint16_t i = 0;
	
	PRINTF("START get_node_ch\n");

	if(node_config.channel < 25 &&
		node_config.channel > 0){
		node_ch = node_config.channel;	
	}else{
		node_ch = RESPONSE_INVALID_ARGU;
	}
		
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_NODECH;
	tlv_set[i].length = BLK_RSP_LEN_GET_NODECH;
	tlv_set[i++].value = &node_ch;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	PRINTF("END get_node_ch\n");
	
}
/*---------------------------------------------------------------------------*/
#if !APROS_OLD_DF
static void subfunc_get_nodeinfo(void* ptr){	
	static apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp[BLK_RSP_LEN_GET_NODEINFO];
	
	uint16_t i = 0;
	uint8_t j = 0;
	uint8_t addr_type;

	uint32_t bat_val;
	uint8_t temperature[2];
	PRINTF("START get_nodeinfo\n");
		
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_NODEINFO;
	tlv_set[i].length = BLK_RSP_LEN_GET_NODEINFO;

	rsp[j++] = RESPONSE_SUCCESS; //Status
	rsp[j++] = (MIN_SAMPLING_EXP<<4) | (MAX_SAMPLING_EXP&0x0f); //Sampling Range
	rsp[j++] = node_config.sampling_exp; //Sampling
	rsp[j++] = BYTE_UNIT; 
	rsp[j++] = (MIN_AXIS<<4) | (MAX_AXIS&0x0f); //Shaft Range
	rsp[j] = AVAILABLE_CHANNEL&0xff;
	rsp[j+1] = (AVAILABLE_CHANNEL >> 8)&0xff;
	rsp[j+2] = (AVAILABLE_CHANNEL >> 16)&0xff;
	rsp[j+3] = (AVAILABLE_CHANNEL >> 24)&0xff; //Available Channel
	j+=4;
	rsp[j++] = node_config.channel;

	// Offset
	rsp[j] = 0;
	rsp[j+1] = node_config.ofc[0];
	rsp[j+2] = node_config.ofc[1];
	rsp[j+3] = node_config.ofc[2];
	rsp[j+4] = 0;
	j+=5;
	// Base ID
	for(uint8_t k = 0 ; k < BLK_LEN_ID ; k ++){
		if(flag_registered){
			rsp[j+k] = node_config.base_id[k];
		}else{
			rsp[j+k] = 0;
		}
	}
	j+=BLK_LEN_ID;
	// Vendor
	memcpy(rsp+j, node_config.__vendor, VENDOR_MAX_LEN);
	j+=VENDOR_MAX_LEN;
	// Firmware Version
	for(uint8_t k = 0 ; k < 4 ; k ++){
		rsp[j+k] = (NAME>>(k<<3))&0xff;
	}
	j+=4;
	// Battery
	/*bat_val = read_bat_voltage();
	for(uint8_t k = 0 ; k < 2 ; k ++){
		rsp[j+k] = (bat_val>>(k<<3))&0xff;
	}*/
	if(bat_val_capt == 0){ //not captured yet
		bat_val = 0xffff; 
	}else{
		bat_val = bat_val_capt;
	}
	for(uint8_t k = 0 ; k < 2 ; k ++){
		rsp[j+k] = (bat_val>>(k<<3))&0xff;
	}
	j+=2;
	// Temperature
	/*temperature = 0; //TODO::
	for(uint8_t k = 0 ; k < 2; k ++){
		rsp[j+k] = (temperature>>(k<<3))&0xff;
	}*/
	if(temperature_capt[0] == 0 && temperature_capt[1] == 0){ //not captured yet
		temperature[0] = temperature[1] = 0xff;
	}else{
		temperature[0] = temperature_capt[0];
		temperature[1] = temperature_capt[1];
	}
	rsp[j] = temperature[1];
	rsp[j+1] = temperature[0];
	j+=2;
	
	tlv_set[i++].value = rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;

	addr_type = *((uint8_t*)ptr);
	if(addr_type == BR_ADDR){
		comm.t_backoff = br_ack_backoff_time;
	}else{
		comm.t_backoff = APROS_COMM_PRIOR_1;
	}

	apros_command(comm);
	PRINTF("END get_nodeinfo\n");
	//
}
#endif
/*---------------------------------------------------------------------------*/
static void subfunc_set_sampling(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	uint8_t sampling_backup;
	
	PRINTF("START set_sampling\n");	
	
	sampling_backup = node_config.sampling_exp;
	node_config.sampling_exp = *((uint8_t*)ptr);
	
	if(apros_node_config_save(&node_config) && 
		node_config.sampling_exp <= MAX_SAMPLING_EXP &&
		node_config.sampling_exp >= MIN_SAMPLING_EXP){
		rsp = RESPONSE_SUCCESS;
		PRINTF("SAMPLING_EXP = %d\n", node_config.sampling_exp);
	}else{
	    if(node_config.sampling_exp <= MAX_SAMPLING_EXP &&
		node_config.sampling_exp >= MIN_SAMPLING_EXP){
			rsp = RESPONSE_FLASH_ERROR;
	    }else{
			rsp = RESPONSE_INVALID_ARGU;
		}
		node_config.sampling_exp = sampling_backup;
		apros_node_config_save(&node_config);
		PRINTF("FAIL\n");
	}
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_SET_SAMPLING;
	tlv_set[i].length = BLK_RSP_LEN_SET_SAMPLING;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	if(sampling_backup != node_config.sampling_exp){
		flag_exist_capt = 0;
		flag_sent_ready_rsp = 0;
	}
	apros_command(comm);
	flag_processing_flash=0;
	PRINTF("END set_sampling\n");
	//
}
/*---------------------------------------------------------------------------*/
static void subfunc_get_sampling(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t sampling;

	uint16_t i = 0;
	
	PRINTF("START get_sampling\n");

	if(node_config.sampling_exp <= MAX_SAMPLING_EXP &&
		node_config.sampling_exp > 0){
		sampling = node_config.sampling_exp;	
	}else{
		sampling = RESPONSE_INVALID_ARGU;
	}
		
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_SAMPLING;
	tlv_set[i].length = BLK_RSP_LEN_GET_SAMPLING;
	tlv_set[i++].value = &sampling;

