acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	PRINTF("END get_sampling\n");
	//
}
/*---------------------------------------------------------------------------*/
static void subfunc_set_vendor(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint16_t i = 0;
	uint8_t vendor_backup[VENDOR_MAX_LEN];
	
	PRINTF("START set_vendor\n");	

	memcpy(vendor_backup, node_config.__vendor, VENDOR_MAX_LEN);
	memcpy(node_config.__vendor, (uint8_t*)ptr, VENDOR_MAX_LEN);
	
	if(apros_node_config_save(&node_config)){
		rsp = RESPONSE_SUCCESS;
		PRINTF("VENDOR = %s\n", node_config.__vendor);
	}else{
		rsp = RESPONSE_FLASH_ERROR;
		memcpy(node_config.__vendor, vendor_backup, VENDOR_MAX_LEN);

		apros_node_config_save(&node_config);
		PRINTF("FAIL\n");
	}
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_SET_VENDOR;
	tlv_set[i].length = BLK_RSP_LEN_SET_VENDOR;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	
	apros_command(comm);
	flag_processing_flash=0;
	PRINTF("END set_vendor\n");
	//
}
/*---------------------------------------------------------------------------*/
static void subfunc_get_vendor(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	uint16_t i = 0;
	
	PRINTF("START get_vendor\n");
		
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_VENDOR;
	tlv_set[i].length = BLK_RSP_LEN_GET_VENDOR;//APROS Co.
	tlv_set[i++].value = node_config.__vendor;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	PRINTF("END get_vendor\n");
	//
}
static void subfunc_data_fetch_ready(void* ptr);
static void subfunc_data_fetch_start(void* ptr);
/*---------------------------------------------------------------------------*/
static void subfunc_capture_req(void* ptr){
	static uint16_t sampling_num;

	static uint16_t z_index = 0;
	static uint8_t *value;
	static uint8_t init_sensor = 0;
	if(!init_sensor){
		PRINTF("START capture\n");
#if APROS_STS3X
		do{
		sts3x_single_shot(temperature_capt, STS3X_SS_CS_LOW);
		}while(temperature_capt[0] == 0 && temperature_capt[1] == 0);
#endif		
		sampling_num = (2 << (node_config.sampling_exp-1));
		value = (uint8_t*)ptr;
		//ti_lib_gpio_set_dio(BOARD_IOID_ADS127L01_RESET);
		ads127l01_enable();

		if(value == NULL){
			ads127l01_stop();
			ads127l01_set_filter(LLFILTER_8K);
			ads127l01_register_write_8(ADS127L01_REG_CONFIG, 0x10);
			ads127l01_register_write_8(ADS127L01_REG_OFC0, 0);
			ads127l01_register_write_8(ADS127L01_REG_OFC1, 0);
			ads127l01_register_write_8(ADS127L01_REG_OFC2, 0);			
		}else{
			ads127l01_stop();
			ads127l01_set_filter(LLFILTER_8K);
			ads127l01_register_write_8(ADS127L01_REG_CONFIG, 0x10);
			ads127l01_register_write_8(ADS127L01_REG_OFC0, node_config.ofc[0]);
			ads127l01_register_write_8(ADS127L01_REG_OFC1, node_config.ofc[1]);
			ads127l01_register_write_8(ADS127L01_REG_OFC2, node_config.ofc[2]);
		}
		
		init_sensor = 1;
		ctimer_set(&ct, CLOCK_SECOND, subfunc_capture_req, NULL);
#if APROS_LED_EXIST
		leds_on(LEDS_GREEN);
#endif
		return;
	}

	ads127l01_start();
	ads127l01_read_data(z_axis_val+z_index);
    ads127l01_stop();
	z_index += BYTE_UNIT;
	
	if(z_index >= sampling_num*BYTE_UNIT){
		z_index = 0;
		if(value == NULL){
			flag_exist_capt = 0;
			flag_sent_ready_rsp = 0;
		}else{
			static apros_comm_param_t comm;
			static tlv_buf_hdr_t tlv_hdr;
			static tlv_set_t tlv_set[2];
			
			static uint8_t rsp;
			
			uint16_t i = 0;
		
			uint8_t addr_type;
					
			tlv_set[i].type = BLK_TYPE_ID;
			tlv_set[i].length = BLK_LEN_ID;
			tlv_set[i++].value = node_mac;
			
			tlv_set[i].type = BLK_TYPE_CAPT_REQUEST;
			tlv_set[i].length = BLK_RSP_LEN_CAPT_REQUEST;
			rsp = RESPONSE_SUCCESS;
			tlv_set[i++].value = &rsp;
	
			tlv_hdr.tlv_p = tlv_set;
	
			tlv_hdr.tlv_num = i;
			
			generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
			tlv_hdr.tlv_p, tlv_hdr.tlv_num);
			/*comm.func = subfunc_response_wireless;
			comm.func_param = &tlv_hdr;

			addr_type = *((uint8_t*)ptr);
			if(addr_type == BR_ADDR){
				comm.t_backoff = APROS_COMM_PRIOR_7+br_ack_backoff_time;
			}else{
				comm.t_backoff = APROS_COMM_PRIOR_1;
			}

			apros_command(comm);*/
			flag_exist_capt = 1;
		}

		init_sensor = 0;
		value = NULL;
		PRINTF("END capture\n");
		ads127l01_stop();
		ads127l01_disable();
#if APROS_LED_EXIST
		leds_off(LEDS_CONF_ALL);
#endif
#if APROS_BATTERY_READ
		bat_val_capt = read_bat_voltage();
#endif
#if APROS_LP
		//ti_lib_gpio_clear_dio(BOARD_IOID_ADS127L01_RESET);
		ti_lib_gpio_clear_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
#endif
#if APROS_LP_VS
		ti_lib_gpio_clear_dio(BOARD_IOID_VS1000_RESET);
		ti_lib_gpio_clear_dio(BOARD_IOID_VS_POWER_ENABLE);
#endif
		//NETSTACK_RDC.on();
		flag_processing_capt = 0;
		uint8_t dummy_val[2]={1, 0};
		subfunc_data_fetch_ready(dummy_val);
	}else{
		//ctimer_set(&ct, 1, (void *)subfunc_caputre_req, NULL); 
		rtimer_set(&rt, RTIMER_NOW(), 0, (void *)subfunc_capture_req, NULL); 
		//warning : rtimer cant pass parameter with NULL.
	}
}
/*---------------------------------------------------------------------------*/
#if APROS_OLD_DF
//deprecated data_fetch function
static void subfunc_data_fetch(void* ptr){
	static uint16_t pkt_index = 0;
	uint8_t pkt_index_8[2];

	static uint8_t accel_data_len;

	static uint16_t z_index = 0;
	//static uint8_t accel_data_cp[MAX_ACCEL_DATA_LEN];

	uint16_t sampling_num = (2 << (node_config.sampling_exp-1));

	static apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[6];
	
	static uint8_t sent_rsp_1 = 0;

	uint16_t i;

	if(!sent_rsp_1){	
		static uint16_t max_index;
		static uint8_t max_index_8[2];
		
		static uint8_t axis;
		static uint8_t rsp_1[6];

		uint8_t sam_divisor;
			
		PRINTF("START fetch\n");
		
		axis = *((uint8_t*)ptr);

		if(axis < 1 ||axis > MAX_AXIS){
			rsp_1[0] = RESPONSE_INVALID_ARGU;
			PRINTF("INVAILD FAIL\n");
		}else if(!flag_exist_capt){
			rsp_1[0] = RESPONSE_NOT_EXIST_CAPT;
			PRINTF("NOT EXIST CAPT FAIL\n");
		}else{
			rsp_1[0] = RESPONSE_SUCCESS;
			
