acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
			//calculate max index
			sam_divisor = MAX_ACCEL_DATA_LEN/axis/BYTE_UNIT; //TODO:: replace division with shift op
			if(sampling_num % sam_divisor == 0){
				max_index = (sampling_num / sam_divisor - 1); //TODO:: replace division with shift op
			}else{
				max_index = (sampling_num / sam_divisor); //TODO:: replace division with shift op
			}
		
			max_index_8[0] = max_index & 0xff;
			max_index_8[1] = (max_index >> 8) & 0xff;

			accel_data_len = sam_divisor * axis * BYTE_UNIT;
			
			last_axis_value = axis;
			last_max_index = max_index;
			last_accel_data_len = accel_data_len;
			
			PRINTF("ACCEL_DATA_LEN = %d\n", accel_data_len);
			PRINTF("MAX_INDEX = %d\n", max_index);
			PRINTF("SAMPLING_EXP = %d\n", node_config.sampling_exp);
			PRINTF("SAMPLING_NUM = %d\n", sampling_num);
		}
		i = 0;
		
		tlv_set[i].type = BLK_TYPE_ID;
		tlv_set[i].length = BLK_LEN_ID;
		tlv_set[i++].value = node_mac;
		
		tlv_set[i].type = BLK_TYPE_DATA_FETCH;
		tlv_set[i].length = BLK_RSP_LEN_DATA_FETCH;
		
		if(rsp_1[0] == RESPONSE_SUCCESS){
			rsp_1[1] = node_config.sampling_exp;
			rsp_1[2] = BYTE_UNIT;
			rsp_1[3] = axis;
			rsp_1[4] = max_index_8[0];
			rsp_1[5] = max_index_8[1];
		}else{
			rsp_1[1] = 0xff;
			rsp_1[2] = 0xff;
			rsp_1[3] = 0xff;
			rsp_1[4] = 0xff;
			rsp_1[5] = 0xff;
		}
		
		tlv_set[i++].value = rsp_1;

		tlv_hdr.tlv_p = tlv_set;

		tlv_hdr.tlv_num = i;
		
		comm.func = subfunc_response_wireless;
		comm.func_param = &tlv_hdr;
		comm.t_backoff = APROS_COMM_PRIOR_1;
		
		apros_command(comm);

		if(rsp_1[0] == RESPONSE_SUCCESS){
			sent_rsp_1 = 1;
			ctimer_set(&ct, 1, subfunc_data_fetch, NULL);
		}else{
			flag_processing_fetch = 0;
		}
		return;
	}
	
		i = 0;

		tlv_set[i].type = BLK_TYPE_ID;
		tlv_set[i].length = BLK_LEN_ID;
		tlv_set[i++].value = node_mac;
		
		tlv_set[i].type = BLK_TYPE_ACCEL_INDEX;
		tlv_set[i].length = BLK_LEN_ACCEL_INDEX;
		
		pkt_index_8[0] = pkt_index & 0xff;
		pkt_index_8[1] = (pkt_index >> 8) & 0xff;
		
		tlv_set[i++].value = pkt_index_8;

		tlv_set[i].type = BLK_TYPE_ACCEL_DATA;
		tlv_set[i].length = accel_data_len;

	
	   tlv_set[i++].value = z_axis_val+z_index; //not apply soft offset

		//for(i = z_axis_val_index; 
		//i < z_axis_val_index+accel_data_len;
		//i+=BIT_UNIT){
		//	PRINTF("%02x%02x%02x\n",
		//		*(z_axis_val+i+0),
		//		*(z_axis_val+i+1),
		//		*(z_axis_val+i+2));
		//}
		
		generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_RAWDATA, tlv_set, i);
		
		z_index += accel_data_len;
		
		//PRINTF("pkt_index = %d\n", pkt_index);

		pkt_index++;
	if(z_index >= sampling_num*BYTE_UNIT){	
		static uint8_t rsp_2;
		
		i = 0;
		
		tlv_set[i].type = BLK_TYPE_ID;
		tlv_set[i].length = BLK_LEN_ID;
		tlv_set[i++].value = node_mac;
		
		tlv_set[i].type = BLK_TYPE_DATA_FETCH;
		tlv_set[i].length = BLK_RSP2_LEN_DATA_FETCH;
		rsp_2 = RESPONSE_SUCCESS;
		tlv_set[i++].value = &rsp_2;

		tlv_hdr.tlv_p = tlv_set;

		tlv_hdr.tlv_num = i;
		
		comm.func = subfunc_response_wireless;
		comm.func_param = &tlv_hdr;
		comm.t_backoff = APROS_COMM_PRIOR_1;
		
		z_index = 0;
		pkt_index = 0;
		sent_rsp_1 = 0;
				
		apros_command(comm);
		flag_processing_fetch = 0;
		PRINTF("END fetch\n");
		
		return;
	}else{
		ctimer_set(&ct, 3, subfunc_data_fetch, NULL);
		return;
	}
}
#else
/*---------------------------------------------------------------------------*/
static void subfunc_data_fetch_ready(void* ptr){
	uint8_t max_index_8[2]={0,0};
	uint16_t max_index;
	
	uint8_t axis;
	uint8_t sam_divisor;
	uint16_t sampling_num;

	uint8_t accel_data_len;

	uint8_t seq_num;

	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];

	uint16_t i;
	
	static uint8_t rsp[BLK_RSP_LEN_DATA_FETCH_READY];	
	PRINTF("START fetch ready\n");
	
	axis = ((uint8_t*)ptr)[0];
	seq_num = ((uint8_t*)ptr)[1]; 

	if(axis > MAX_AXIS || axis < 1){
		rsp[0] = RESPONSE_INVALID_ARGU;
		PRINTF("FAIL: Invalid Argument\n");
	}else if(!flag_exist_capt){
		rsp[0] = RESPONSE_NOT_EXIST_CAPT;
		PRINTF("FAIL: Not exist Capture\n");
	}else{
		rsp[0] = RESPONSE_SUCCESS;
		
		//calculate max index
		sampling_num  = (2 << (node_config.sampling_exp-1));
		sam_divisor = MAX_ACCEL_DATA_LEN/axis/BYTE_UNIT; //Never change to just "sam_divisor" //TODO:: replace division with shift op
		if(sampling_num % sam_divisor == 0){
			max_index = (sampling_num / sam_divisor - 1); //TODO:: replace division with shift op
		}else{
			max_index = (sampling_num / sam_divisor); //TODO:: replace division with shift op
		}

		max_index_8[0] = max_index & 0xff;
		max_index_8[1] = (max_index >> 8) & 0xff;

		accel_data_len = sam_divisor * axis * BYTE_UNIT;

		last_axis_value = axis;
		last_accel_data_len = accel_data_len;
		last_max_index = max_index;
					
		PRINTF("ACCEL_DATA_LEN = %d\n", accel_data_len);
		PRINTF("MAX_INDEX = %d\n", max_index);
		PRINTF("SAMPLING_EXP = %d\n", node_config.sampling_exp);
		PRINTF("SAMPLING_NUM = %d\n", sampling_num);
	}
	i = 0;
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_DATA_FETCH_READY;
	tlv_set[i].length = BLK_RSP_LEN_DATA_FETCH_READY;
	
	if(rsp[0] == RESPONSE_SUCCESS){
		rsp[1] = seq_num;
		rsp[2] = node_config.sampling_exp;
		rsp[3] = BYTE_UNIT;
		rsp[4] = axis;
		rsp[5] = max_index_8[0];
		rsp[6] = max_index_8[1];
		rsp[7] = bat_val_capt & 0xff;
		rsp[8] = (bat_val_capt >> 8) & 0xff;
		rsp[9] = temperature_capt[1]; //temperature
		rsp[10] = temperature_capt[0]; //temperatue
	}else{
		rsp[1] = seq_num;
		rsp[2] = 0xff;
		rsp[3] = 0xff;
		rsp[4] = 0xff;
		rsp[5] = 0xff;
		rsp[6] = 0xff;
		rsp[7] = 0xff;
		rsp[8] = 0xff;
		rsp[9] = 0xff;
		rsp[10] = 0xff;
	}
	
	tlv_set[i++].value = rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	/*comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	
	apros_command(comm);*/
	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
		tlv_hdr.tlv_p, tlv_hdr.tlv_num);

	if(rsp[0] == RESPONSE_SUCCESS){
		flag_sent_ready_rsp = 1;
	}
	flag_processing_fetch = 1;
	subfunc_data_fetch_start(NULL);
	PRINTF("END fetch ready\n");
}
/*---------------------------------------------------------------------------*/
static void subfunc_data_fetch_start(void* ptr){
	static uint16_t pkt_index = 0;
	static uint8_t seq_num = 0;
	uint8_t pkt_index_8[2];

	static uint16_t z_index = 0;

