acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
	static uint16_t sampling_num;

	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[3];
	
	static uint8_t accel_data_littleed[MAX_ACCEL_DATA_LEN];
	uint16_t i=0;

	static uint8_t rsp[2];
	
	
	if(z_index == 0){
		seq_num = *((uint8_t*)ptr);
		if(!flag_sent_ready_rsp){
			PRINTF("FAIL\n");
			tlv_set[i].type = BLK_TYPE_ID;
			tlv_set[i].length = BLK_LEN_ID;
			tlv_set[i++].value = node_mac;
			
			tlv_set[i].type = BLK_TYPE_DATA_FETCH_START;
			tlv_set[i].length = BLK_RSP_LEN_DATA_FETCH_START;

			seq_num = *((uint8_t*)ptr);
			rsp[0] = RESPONSE_NOT_FETCH_RDY;
			rsp[1] = seq_num;
			tlv_set[i++].value = rsp;

			tlv_hdr.tlv_p = tlv_set;

			tlv_hdr.tlv_num = i;
		
			comm.func = subfunc_response_wireless;
			comm.func_param = &tlv_hdr;
			comm.t_backoff = APROS_COMM_PRIOR_1;
			z_index = 0;
			pkt_index = 0;
			
			apros_command(comm);

			flag_processing_fetch = 0;
			PRINTF("END fetch start\n");
			return;
		}else{
			PRINTF("START fetch start\n");
#if APROS_LED_EXIST
		    leds_on(LEDS_BLUE);
#endif
			sampling_num  = (2 << (node_config.sampling_exp-1));
		}
	}
	
	i = 0;

	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_ACCEL_INDEX;
	tlv_set[i].length = BLK_LEN_ACCEL_INDEX;
	
	pkt_index_8[0] = pkt_index & 0xff;
	pkt_index_8[1] = (pkt_index >> 8) & 0xff;
	
	tlv_set[i++].value = pkt_index_8;

	tlv_set[i].type = BLK_TYPE_ACCEL_DATA;
	tlv_set[i].length = last_accel_data_len;

	//little endian
	{
		uint8_t ad_index = 0;
		for(uint16_t i = z_index ; i < z_index+last_accel_data_len ; i+=BYTE_UNIT){ 
			for(uint8_t j = 0 ; j < BYTE_UNIT ; j++){
				accel_data_littleed[ad_index+BYTE_UNIT-1-j] = z_axis_val[i+j];
			}
			ad_index += BYTE_UNIT;
		}
	}
	tlv_set[i].value = accel_data_littleed;
	
	//big endian
	//tlv_set[i].value = z_axis_val+z_index; 
	
	i++;
	generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_RAWDATA, tlv_set, i);
	
	z_index += last_accel_data_len;

	pkt_index++;
	
	if(z_index >= sampling_num*BYTE_UNIT){	
		
		i = 0;
		
		tlv_set[i].type = BLK_TYPE_ID;
		tlv_set[i].length = BLK_LEN_ID;
		tlv_set[i++].value = node_mac;
		
		tlv_set[i].type = BLK_TYPE_DATA_FETCH_START;
		tlv_set[i].length = BLK_RSP_LEN_DATA_FETCH_START;
		rsp[0] = RESPONSE_SUCCESS;
		rsp[1] = seq_num; 
		tlv_set[i++].value = rsp;

		tlv_hdr.tlv_p = tlv_set;

		tlv_hdr.tlv_num = i;
		
		/*comm.func = subfunc_response_wireless;
		comm.func_param = &tlv_hdr;
		comm.t_backoff = APROS_COMM_PRIOR_1;*/
		generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
		tlv_hdr.tlv_p, tlv_hdr.tlv_num);
		
		z_index = 0;
		seq_num = 0;
		pkt_index = 0;
		
/*		apros_command(comm);*/
#if APROS_LED_EXIST
		leds_off(LEDS_CONF_ALL);
#endif
		flag_processing_fetch = 0;
		
		PRINTF("END fetch start\n");
		uint8_t dummy_val =1;
		subfunc_capture_req(&dummy_val);
		return;
	}else{
#if APROS_LED_EXIST
		leds_toggle(LEDS_RED);
#endif
		ctimer_set(&ct, 3, subfunc_data_fetch_start, NULL);
		return;
	}
}
#endif
/*---------------------------------------------------------------------------*/
static void subfunc_retrans_req(void* ptr){
	uint16_t pkt_index;
	static uint8_t pkt_index_8[2];

	static uint8_t accel_data_len;
//	static uint8_t accel_data_cp[MAX_ACCEL_DATA_LEN];
	
	static apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[6];
	
	static uint8_t accel_data_littleed[MAX_ACCEL_DATA_LEN];
	
	uint16_t i;
	
	static uint8_t rsp[BLK_RSP_LEN_RETT];
	
    PRINTF("START rett\n");
	pkt_index_8[0] = ((uint8_t*)ptr)[0];
	pkt_index_8[1] = ((uint8_t*)ptr)[1];

	pkt_index = ((uint16_t)pkt_index_8[1] << 8) | pkt_index_8[0];	

	if(last_accel_data_len == 0||last_axis_value == 0){
		rsp[0] = RESPONSE_NOT_EXIST_CAPT;
		PRINTF("FAIL\n");
	}else if(pkt_index > last_max_index||pkt_index < 0){
		rsp[0] = RESPONSE_INVALID_ARGU;
		PRINTF("FAIL\n");
	}else{
		rsp[0] = RESPONSE_SUCCESS;
		PRINTF("INDEX = %d\n", pkt_index);
		
		i = 0;
		
		tlv_set[i].type = BLK_TYPE_ID;
		tlv_set[i].length = BLK_LEN_ID;
		tlv_set[i++].value = node_mac;
		
		tlv_set[i].type = BLK_TYPE_ACCEL_INDEX;
		tlv_set[i].length = BLK_LEN_ACCEL_INDEX;
		tlv_set[i++].value = pkt_index_8;
		
		tlv_set[i].type = BLK_TYPE_ACCEL_DATA;
		accel_data_len = last_accel_data_len;
		tlv_set[i].length = accel_data_len;
		
		//apply soft offset to accel value
		/*memcpy(accel_data_cp, z_axis_val+pkt_index*accel_data_len, accel_data_len);
		for(uint16_t i = 0; i < accel_data_len/BYTE_UNIT; i++){
			uint32_t unsigned32_data=0;
			int32_t signed32_data=0;

			for(uint16_t j = 0; j<BYTE_UNIT; j++){
				unsigned32_data |= (uint32_t)accel_data_cp[i*BYTE_UNIT+j]<<((BYTE_UNIT-1-j)<<3);
				//printf("%02x", accel_data_cp[i*BYTE_UNIT+j]);
			}
			//printf("\n");
			//printf("unsigned value : %06x\n", unsigned32_data);

			if(unsigned32_data >= MAX_VALUE_BOUND_SIGNED+1 //minimum nagative boundary : (24bit) 0x7FFFFF + 1 = 0x800000
				&& unsigned32_data <= MAX_VALUE_BOUND_UNSIGNED) //-1 : (24bit) 0xFFFFFF = -1
			{
				//negative accel_data
				signed32_data = unsigned32_data-0x1000000; //make unsigned value to signed value(negative).
			}else{
				signed32_data = unsigned32_data;
			}

			//printf("signed value : %06x\n", signed32_data);
			signed32_data += node_config.offset_val;
			//printf("signed value + offset : %06x\n", signed32_data);
			
			if(signed32_data<MIN_VALUE_BOUND_SIGNED){
				signed32_data = MIN_VALUE_BOUND_SIGNED;
			}
			if(signed32_data>MAX_VALUE_BOUND_SIGNED){
				signed32_data = MAX_VALUE_BOUND_SIGNED;
			}
				
			if(signed32_data >= 0){
				unsigned32_data = signed32_data;
			}else{
				unsigned32_data = signed32_data+0x1000000; //signed value(nagative) to unsigned value
			}
			//printf("result:");
			for(uint16_t j = 0 ; j<BYTE_UNIT; j++){
				//accel_data_cp[i*BYTE_UNIT+j] = (unsigned32_data>>(j*8)) & 0xff ; //big endian to little endian  
				accel_data_cp[i*BYTE_UNIT+j] = (unsigned32_data>>((BYTE_UNIT-1-j)<<3)) & 0xff ; //big endian
				//printf("%02x", accel_data_cp[i*BYTE_UNIT+j]);
			}
			//printf("\n");
		}*/
		//little endian
		{
			uint8_t ad_index = 0;
			uint16_t r_index = pkt_index*accel_data_len;
			for(uint16_t i = r_index ; i < r_index+last_accel_data_len ; i+=BYTE_UNIT){ 
				for(uint8_t j = 0 ; j < BYTE_UNIT ; j++){
					accel_data_littleed[ad_index+BYTE_UNIT-1-j] = z_axis_val[i+j];
				}
				ad_index += BYTE_UNIT;
			}
		}
		tlv_set[i++].value = accel_data_littleed;

