acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
		//big endian
		//tlv_set[i++].value = z_axis_val+pkt_index*accel_data_len;
		
		//tlv_set[i++].value = accel_data_cp;
		generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_RAWDATA, tlv_set, i);
	}
	
	i = 0;
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_RETT;
	tlv_set[i].length = BLK_RSP_LEN_RETT;

	if(rsp[0] == RESPONSE_SUCCESS){
		rsp[1] = node_config.sampling_exp;
		rsp[2] = BYTE_UNIT;
		rsp[3] = last_axis_value;
		rsp[4] = pkt_index_8[0];
		rsp[5] = pkt_index_8[1];
	}else{
		rsp[1] = 0xff;
		rsp[2] = 0xff;
		rsp[3] = 0xff;
		rsp[4] = 0xff;
		rsp[5] = 0xff;
	}
	
	tlv_set[i++].value = rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	
	apros_command(comm);
	PRINTF("END rett\n");
	
}
/*---------------------------------------------------------------------------*/
static uint8_t subfunc_write_offset(uint8_t* offset_arr){
	uint8_t ofc_backup[3];
	int32_t offset_value;
	uint8_t ret;

	offset_value = 
		offset_arr[0]|
		((offset_arr[1]>>8)&0xff)|
		((offset_arr[2]>>16)&0xff)|
		((offset_arr[3]>>24)&0xff);

	if(offset_value > 0xFFFFFF){//only for 24bit
		return RESPONSE_INVALID_ARGU;
	}
	else if(offset_value > 0x7FFFFF){//only for 24bit
		offset_value = offset_value - 0x1000000;
	}

	for(uint8_t i = 0 ; i < BYTE_UNIT; i++){
		ofc_backup[i] = node_config.ofc[i];
		node_config.ofc[i] = offset_arr[i];
	}
	
	if(apros_node_config_save(&node_config) && 
		offset_value<= MAX_OFFSET_BOUND_SIGNED &&
		offset_value>= MIN_OFFSET_BOUND_SIGNED){
		ret = RESPONSE_SUCCESS;
		//ads127l01_register_write_8(ADS127L01_REG_OFC0, node_config.ofc[0]);
		//ads127l01_register_write_8(ADS127L01_REG_OFC1, node_config.ofc[1]);
		//ads127l01_register_write_8(ADS127L01_REG_OFC2, node_config.ofc[2]);
		PRINTF("OFFSET = %d\n", (int)offset_value);
	}else{
		if(offset_value<= MAX_OFFSET_BOUND_SIGNED &&
		offset_value>= MIN_OFFSET_BOUND_SIGNED){
			ret = RESPONSE_FLASH_ERROR;
		}else{
			ret = RESPONSE_INVALID_ARGU;
		}

		for(uint8_t i = 0 ; i < BYTE_UNIT; i++){
			node_config.ofc[i] = ofc_backup[i];
		}
		apros_node_config_save(&node_config);
		PRINTF("FAIL\n");
	}
	return ret;
}
/*---------------------------------------------------------------------------*/
static void subfunc_set_offset(void* ptr){
	apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	
	static uint8_t rsp;

	uint8_t* offset_input;
	uint16_t i = 0;
	//uint8_t ofc_backup[3];
	
	PRINTF("START set_offset\n");	

	offset_input = (uint8_t*)ptr;

	rsp = subfunc_write_offset(offset_input);
	
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_SET_OFFSET;
	tlv_set[i].length = BLK_RSP_LEN_SET_OFFSET;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;
	
	apros_command(comm);
	flag_processing_flash=0;
	PRINTF("END set_offset\n");
	//
}
/*---------------------------------------------------------------------------*/
static void subfunc_get_offset(void* ptr){
	static apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	static uint8_t converted_arr[5];
	uint16_t i = 0;
	
	PRINTF("START get_offset\n");

	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_GET_OFFSET;
	tlv_set[i].length = BLK_RSP_LEN_GET_OFFSET;

	converted_arr[0] = RESPONSE_SUCCESS;
	for(uint8_t i=0; i<3; i++){//only for 24bit
		converted_arr[i+1] = node_config.ofc[i]; 
	}
	
	tlv_set[i++].value = converted_arr;

	tlv_hdr.tlv_p = tlv_set;

	tlv_hdr.tlv_num = i;
	
	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	PRINTF("END get_offset\n");
	//
}
/*---------------------------------------------------------------------------*/
static void subfunc_auto_offset_calibration(void* ptr){
	static apros_comm_param_t comm;
	static tlv_buf_hdr_t tlv_hdr;
	static tlv_set_t tlv_set[2];
	static uint8_t rsp;
	uint16_t i = 0;
	uint16_t sampling_num = (2 << (node_config.sampling_exp-1));
	int32_t max_z_val=0, min_z_val=0, center_z_val;
	//int32_t org_offset;
	uint8_t offset_input[4];
	
	PRINTF("START auto_offset_calibration\n");
	
	for(uint16_t i = 0 ; i < sampling_num ; i++){
		int32_t z_val = 0;
		for(uint16_t j = 0 ; j < BYTE_UNIT ; j++){
			z_val |= z_axis_val[i*BYTE_UNIT+j]<<((BYTE_UNIT-1-j)<<3);
		};
		
		if(z_val > 0x7FFFFF){
			z_val = (z_val&0xffffff)-0x1000000;
		}
		if(i == 0){
			max_z_val = min_z_val = z_val;
		}else{
			if(z_val > max_z_val){
			max_z_val = z_val;
			}	
			if(z_val < min_z_val){
				min_z_val = z_val;
			}
		}
	}
	//printf("max_z_val = %03x\n", max_z_val);
	//printf("min_z_val = %03x\n", min_z_val);
	/*org_offset = node_config.ofc[0] | (node_config.ofc[1]<<8) | (node_config.ofc[2]<<16);
	if(org_offset > 0x7FFFFF){
		org_offset = (org_offset&0xffffff)-0x1000000;
	}*/
	//printf("org_offset = %03x\n", org_offset);
	center_z_val = (max_z_val + min_z_val) / 2 ;//+ org_offset;
	//printf("center_z_val = %03x\n", center_z_val);
	for(uint8_t i = 0 ; i < 4 ; i ++){
		offset_input[i] = (center_z_val>>(i<<3))&0xff; 
	}
		
	rsp=subfunc_write_offset(offset_input);
		
	tlv_set[i].type = BLK_TYPE_ID;
	tlv_set[i].length = BLK_LEN_ID;
	tlv_set[i++].value = node_mac;
	
	tlv_set[i].type = BLK_TYPE_AUTO_OFFSET;
	tlv_set[i].length = BLK_RSP_LEN_AUTO_OFFSET;
	tlv_set[i++].value = &rsp;

	tlv_hdr.tlv_p = tlv_set;
	tlv_hdr.tlv_num = i;

	comm.func = subfunc_response_wireless;
	comm.func_param = &tlv_hdr;
	comm.t_backoff = APROS_COMM_PRIOR_1;

	apros_command(comm);
	ads127l01_disable();
	PRINTF("END auto_offset_calibration\n");
}
/*---------------------------------------------------------------------------*/
/*static void subfunc_realtime(void* ptr){
	//TODO:: mode change to realtime sending
}*/
/*---------------------------------------------------------------------------*/
static uint8_t consume_wireless_payload(uint8_t* pl, uint8_t pl_len){
	static uint8_t addr_type;
	uint8_t pl_index;
	static struct tlv_set tlv;
	static struct apros_comm_param comm;
	const linkaddr_t *src = packetbuf_addr(PACKETBUF_ADDR_SENDER);
	const uint8_t is_frombase = linkaddr_cmp(src, (linkaddr_t*)(node_config.base_id+6));
	flag_processing_msg = 1;

	addr_type = verify_addr(pl); 
	if(addr_type == BR_ADDR || addr_type == MY_ADDR){
		pl_index = BLK_LEN_ID+2; //next to ID TLV
	}else{
		return 0;
	}
	
	while(pl_len > pl_index){

