acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
		//TLV
		tlv.type = pl[pl_index];
		tlv.length = pl[pl_index+1];
		if(tlv.length){
			tlv.value = pl+pl_index+2;
		}else{
			tlv.value = NULL;
		}
		
		
		if(flag_registered){
			PRINTF("REGISTERED\n");
		}else{
			PRINTF("NOT REGISTERED\n");
		}

		if(flag_processing_fetch || flag_processing_capt || flag_processing_reboot || flag_processing_flash){
			static error_cb_st_t er_node_busy;
			er_node_busy.error_type = RESPONSE_NODE_BUSY;
			my_msg_info.p_cont_block_info = find_cont_block_info(tlv.type);
			er_node_busy.msg_info = &my_msg_info;

			if(tlv.type == BLK_TYPE_DATA_FETCH_READY){
				error_pass_seq = tlv.value[1];
			}
			if(tlv.type == BLK_TYPE_DATA_FETCH_START){
				error_pass_seq = tlv.value[0];
			}
			subfunc_error_rsp_wireless((void*)&er_node_busy);
			PRINTF("ERR: NODE BUSY\n");
			flag_processing_msg = 0;
			return -1;
		}

		switch(tlv.type){
			case BLK_TYPE_REGISTER_NODE:
				if(addr_type == MY_ADDR){
					flag_processing_flash = 1;
					comm.func = subfunc_register_node;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_DEV_RESET:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_reboot = 1;
					comm.func = subfunc_dev_reset;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_9;
					
					apros_command(comm);
				}
				break;
			case BLK_TYPE_FTRY_RESET:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_reboot = 1;
					comm.func = subfunc_factory_reset;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_9;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_SET_NODECCA:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_flash = 1;
					comm.func = subfunc_set_cca;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_GET_NODECCA:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_get_cca;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_SET_NODECH:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_flash = 1;
					comm.func = subfunc_set_nodech;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_GET_NODECH:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_get_nodech;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_SET_SAMPLING:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_flash = 1;
					comm.func = subfunc_set_sampling;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;
					
					apros_command(comm);
				}
				break;
			case BLK_TYPE_GET_SAMPLING:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_get_sampling;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_SET_VENDOR:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_flash = 1;
					comm.func = subfunc_set_vendor;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;
					
					apros_command(comm);
				}
				break;
			case BLK_TYPE_GET_VENDOR:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_get_vendor;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			/*
			case BLK_TYPE_CAPT_REQUEST:	
				if(flag_registered && is_frombase){
					flag_processing_capt = 1;
					NETSTACK_RDC.off(1);
					comm.func = subfunc_capture_req;
					comm.func_param = &addr_type; 
					comm.t_backoff = APROS_COMM_PRIOR_3;
#if APROS_LP
					//ti_lib_gpio_clear_dio(BOARD_IOID_ADS127L01_RESET);
					ti_lib_gpio_set_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
					//ti_lib_gpio_set_dio(BOARD_IOID_ADS127L01_RESET);
#endif
#if APROS_LP_VS
					ti_lib_gpio_set_dio(BOARD_IOID_VS1000_RESET);
					ti_lib_gpio_set_dio(BOARD_IOID_VS_POWER_ENABLE);
#endif
					apros_command(comm);
				}
				break;*/
#if APROS_OLD_DF
			/*//old data fetch
			case BLK_TYPE_DATA_FETCH:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_fetch = 1;
					comm.func = subfunc_data_fetch;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;
					
					apros_command(comm);
				}
				break;*/
#else
			/*
			case BLK_TYPE_DATA_FETCH_READY:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_data_fetch_ready;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_DATA_FETCH_START:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_fetch = 1;
					comm.func = subfunc_data_fetch_start;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				*/
				break;
			case BLK_TYPE_GET_NODEINFO:
				if(flag_registered  && is_frombase){
					comm.func = subfunc_get_nodeinfo;
					comm.func_param = &addr_type;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
#endif
			case BLK_TYPE_RETT:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_retrans_req;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_SET_OFFSET:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_flash = 1;
					comm.func = subfunc_set_offset;
					comm.func_param = tlv.value;
					comm.t_backoff = APROS_COMM_PRIOR_1;

