acidlikk/co_re_ksh_1/examples/apros/cc1310/ads127l01_autocap/node/cc13xx-node.c
					apros_command(comm);
				}
				break;
			case BLK_TYPE_GET_OFFSET:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					comm.func = subfunc_get_offset;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_1;

					apros_command(comm);
				}
				break;
			case BLK_TYPE_AUTO_OFFSET:
				if(flag_registered && addr_type == MY_ADDR && is_frombase){
					flag_processing_capt = 1;
					NETSTACK_RDC.off(1);
					comm.func=subfunc_capture_req;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_3;
#if APROS_LP
					ti_lib_gpio_set_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
#endif
#if APROS_LP_VS
					ti_lib_gpio_set_dio(BOARD_IOID_VS1000_RESET);
					ti_lib_gpio_set_dio(BOARD_IOID_VS_POWER_ENABLE);
#endif

					apros_command(comm);
										
					comm.func = subfunc_auto_offset_calibration;
					comm.func_param = NULL;
					comm.t_backoff = APROS_COMM_PRIOR_9+APROS_COMM_PRIOR_9;

					apros_command(comm);
				}
				break;
		}

		pl_index += tlv.length + 2; //length(1) + type(1) + value
	}
	flag_processing_msg = 0;
	return 1;
}
/*---------------------------------------------------------------------------*/
static void packet_recv(uint8_t* pbuf, uint16_t plen){
	static uint8_t pl[APROS_PL_MAX_SIZE], pl_length;
	PRINTF("RECV packet : %d\n", plen);
	for(uint16_t i = 0 ; i < plen ; i++){
		PRINTF("%02x ", pbuf[i]);
	}
	PRINTF(" \n");

	if(apros_node_pkt_parser(pbuf, plen, pl, &pl_length) == 1 && !flag_processing_msg){
		consume_wireless_payload(pl, pl_length);
		PRINTF("CONSUME PKT\n");
	}else{
		PRINTF("INVALID FORMAT\n");
	}
}
/*---------------------------------------------------------------------------*/
void loop_capture_fetch(void* ptr){
	static uint8_t dummy = 1;
	
	ti_lib_gpio_set_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
	flag_processing_capt = 1;
	subfunc_capture_req(&dummy);
}
/*---------------------------------------------------------------------------*/
PROCESS(cc1310_process, "cc1310_process");
AUTOSTART_PROCESSES(&cc1310_process);
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(cc1310_process, ev, data)
{
  	PROCESS_EXITHANDLER(apros_wireless_line_close();)
  	PROCESS_BEGIN();
	//NETSTACK_RADIO.off();
	//NETSTACK_RADIO.off();
#if APROS_LP
	ti_lib_gpio_clear_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
#endif
#if APROS_LP_VS
	ti_lib_gpio_clear_dio(BOARD_IOID_VS1000_RESET);
	ti_lib_gpio_clear_dio(BOARD_IOID_VS_POWER_ENABLE);
#endif
  	init_setting();
	etimer_set(&et, CLOCK_SECOND);
	ctimer_set(&ct, CLOCK_SECOND, loop_capture_fetch, NULL);
	//lpm_drop();
  /***/
 
	/*NETSTACK_RADIO.off();
  	ti_lib_gpio_clear_dio(BOARD_IOID_SENSOR_POWER_ENABLE);*/
  /***/
  //ads127l01_register_read_8(ADS127L01_REG_ID, &tmp);
	//PRINTF("start\n");
	//ads127l01_register_read_8(ADS127L01_REG_ID, &tmp);
	//PRINTF("ID = %x\n", tmp);
	/*ads127l01_register_write_8(ADS127L01_REG_CONFIG, 0x30);
	//ads127l01_register_write_8(ADS127L01_REG_CONFIG, 0x01);
	ads127l01_register_read_8(ADS127L01_REG_CONFIG, &tmp);
	//PRINTF("1 = %x\n", tmp);
	//ads127l01_register_write_8(ADS127L01_REG_CONFIG, 0x00);
	ads127l01_register_read_8(ADS127L01_REG_OFC0, &tmp);
	//PRINTF("2 = %x\n", tmp);
	ads127l01_register_read_8(ADS127L01_REG_OFC1, &tmp);
	//PRINTF("3 = %x\n", tmp);
	ads127l01_register_read_8(ADS127L01_REG_OFC2, &tmp);
	//PRINTF("4 = %x\n", tmp);
	ads127l01_register_read_8(ADS127L01_REG_FSC0, &tmp);
	//PRINTF("5 = %x\n", tmp);
	ads127l01_register_read_8(ADS127L01_REG_FSC1, &tmp);
	//PRINTF("6 = %x\n", tmp);
	ads127l01_register_read_8(ADS127L01_REG_MODE, &tmp);
	//PRINTF("MODE = %x\n", tmp);	*/	
	
	//m41t64_reg_read(M41T64_REG_0A, &data);
	//PRINTF("data : %x\n", data);
	//m41t64_reg_read(M41T64_REG_04, &data);
	//PRINTF("data : %x\n", data);
	
	//etimer_set(&et, 1*CLOCK_SECOND);
	//ti_lib_gpio_set_dio(BOARD_IOID_SENSOR_POWER_ENABLE);
  	while(1) {
    	PROCESS_YIELD();
		if(ev == PROCESS_EVENT_TIMER) {
			etimer_set(&et, 100*CLOCK_SECOND);
		/*
			etimer_set(&et, 3*CLOCK_SECOND);

			static tlv_buf_hdr_t tlv_hdr;
			static tlv_set_t tlv_set[2];
				
			static uint8_t rsp[4];
			uint8_t i = 0;
			uint32_t bat_val = read_bat_voltage();
			tlv_set[i].type = BLK_TYPE_ID;
			tlv_set[i].length = BLK_LEN_ID;
			tlv_set[i++].value = node_mac;
			
			tlv_set[i].type = BLK_TYPE_DEV_RESET;
			tlv_set[i].length = 4;
			rsp[0] = (bat_val >> 24);
			rsp[1] = (bat_val >> 16) & 0xff;
			rsp[2] = (bat_val >> 8) & 0xff;
			rsp[3] = bat_val & 0xff;
			tlv_set[i++].value = rsp;

			tlv_hdr.tlv_p = tlv_set;

			tlv_hdr.tlv_num = i;
	
			generate_pkt_wireless((linkaddr_t*)(node_config.base_id+6), MSG_TYPE_CONTROL, 
			tlv_hdr.tlv_p, tlv_hdr.tlv_num);*/
			//uint8_t res;
			//if(stimer_expired(&st_comm)){	
			//apros_serial_send(pkt,4);
		//	rt_call();
			//ctimer_set(&ct, 
			//command_capture_req(NULL);
			//command_data_fetch(NULL);
			//m41t64_close();
			//}
			//etimer_set(&et, CLOCK_SECOND*15);
		}
  	}
  	PROCESS_END();
}

/**
 * @}
 * @}
 * @}
 */

